--1.取前几条数据。

--2.先根据部门编号升序，再根据薪水降序。

--3.查询出雇员表(emp)中comm为null的记录。

--4.查询出雇员表(emp)中员工的姓名,将名字中的'A'换为'1','B'换为'2'。

--5.查询出每个部门的平均薪水，并显示出部门详细信。

--6.查询出部门人员中薪水大于2000的人在2个以上的部门。

--7.求出每个部门中薪水最高的员工。

--8.分别统计出各个月份入职(hiredate)的员工有多少人。

--9.查询scott.emp表中所有列。

--10.查询scott.emp表中的ename列。

--11.查询scott.emp表中ename列，将其列名改为“雇员姓名”。

--12.查询scott.emp表中sal、comm两项工资的总和。

--13.消除emp表中job列的重复值。

--14.查看scott.emp表中在10号部门的所有员工具体情况。

--15.查询scott.emp表中工资在1500和3000之间的雇员编号。

--16.查询scott.emp表中在10、20或30号部门工作的雇员编号。

--17.查询scott.emp表中名字中含有K字母的雇员姓名。

--18.查询comm列为NULL的雇员信息。

--19.查询10号部门工资在1000元以上的雇员信息。

--20.将emp表按照部门号升序、员工编号降序排列。

--21.统计scott.emp表中各部门的人数。

--22.统计各部门人数，将多于5人的部门编号输出。

--23.将scott.emp表中的内容复制一份到newemp表。内置函数 

--24.查看A的ASCII码。

--2--5.查看ASCII码为65的字符。

--26.使用LENGTH函数求字符串‘This is Oracle 11g’。

--27.使用CONCAT函数将EMP表中各元组的ename添加在job之后。

--28.使用SUBSTRING函数、SUBSTR函数

--29.使用MOD函数求8除以3的余数。

--30.使用ROUND函数取整。

